app/models/book/accessable.rb

  def accessable?(user: Current.user)
    accesses.exists?(user: user)
---
SELECT 1 AS one FROM "accesses" WHERE "accesses"."book_id" IS NULL AND (1=0) AND "accesses"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def access_for(user: Current.user)
    accesses.find_by(user: user)
---
SELECT "accesses".* FROM "accesses" WHERE "accesses"."book_id" = ? AND "accesses"."user_id" = ? LIMIT ?  [["book_id", 1], ["user_id", 1], ["LIMIT", 1]]

  def update_access(editors:, readers:)
    editors = Set.new(editors)
    readers = Set.new(everyone_access? ? User.active.ids : readers)

    all = editors + readers
    all_accesses = all.collect { |user_id|
      { user_id: user_id, level: editors.include?(user_id) ? :editor : :reader }
    }

    accesses.upsert_all(all_accesses, unique_by: [ :book_id, :user_id ])
    accesses.where.not(user_id: all).delete_all
---
SELECT "users"."id" FROM "users" WHERE "users"."active" = ?  [["active", 1]]
INSERT INTO "accesses" ("user_id","level","book_id","created_at","updated_at") VALUES (1, 'editor', 1, STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW'), STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW')) ON CONFLICT ("user_id","book_id") DO UPDATE SET updated_at=(CASE WHEN ("level" IS excluded."level") THEN "accesses".updated_at ELSE STRFTIME('%Y-%m-%d %H:%M:%f', 'NOW') END),"level"=excluded."level" RETURNING "id"
DELETE FROM "accesses" WHERE "accesses"."book_id" = ? AND "accesses"."user_id" != ?  [["book_id", 1], ["user_id", 1]]