app/views/pages/edits/show.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---

      <%= @edit.page.body.to_html %>

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---

    <%= @leaf.page.body.to_html %>