app/models/leaf/editable.rb

    def last_edit_old?
      edits.empty? || edits.last.created_at.before?(MINIMUM_TIME_BETWEEN_VERSIONS.ago)
---
SELECT "edits".* FROM "edits" WHERE "edits"."leaf_id" = ? ORDER BY "edits"."id" DESC LIMIT ?  [["leaf_id", 1], ["LIMIT", 1]]

    def will_change_leafable?(leafable_params)
      leafable_params.select do |key, value|
        leafable.attributes[key.to_s] != value
      end.present?
---
SELECT 1 AS one FROM "edits" WHERE "edits"."leaf_id" = ? LIMIT ?  [["leaf_id", 1], ["LIMIT", 1]]

    def update_without_recording_edit(leaf_params, leafable_params)
      transaction do
        leafable.update!(leafable_params)

        edits.last&.touch
---
SELECT "edits".* FROM "edits" WHERE "edits"."leaf_id" = ? ORDER BY "edits"."id" DESC LIMIT ?  [["leaf_id", 1], ["LIMIT", 1]]
UPDATE "edits" SET "updated_at" = ? WHERE "edits"."id" = ?  [["updated_at", "2025-09-22 17:11:26.868968"], ["id", 2]]

    def update_and_record_edit(leaf_params, leafable_params)
      transaction do
        new_leafable = dup_leafable_with_attachments leafable
        new_leafable.update!(leafable_params)

        edits.revision.create!(leafable: leafable)
---
INSERT INTO "edits" ("leaf_id", "leafable_type", "leafable_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["leaf_id", 1], ["leafable_type", "Page"], ["leafable_id", 1], ["action", "revision"], ["created_at", "2025-09-22 16:47:42.104024"], ["updated_at", "2025-09-22 16:47:42.104024"]]