app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.accessable_or_published.find params[:id]

SELECT 1 AS one FROM "books" WHERE "books"."published" = ? LIMIT ?  [["published", 1], ["LIMIT", 1]]
---
    def ensure_index_is_not_empty
      if !signed_in? && Book.published.none?