app/controllers/first_runs_controller.rb

INSERT INTO "users" ("name", "email_address", "password_digest", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    user = FirstRun.create!(user_params)

SELECT 1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]
---
    def prevent_running_after_setup
      redirect_to root_url if User.any?