app/controllers/sessions_controller.rb

    def ensure_user_exists
      redirect_to first_run_url if User.none?
---
SELECT 1 AS one FROM "users" LIMIT ?  [["LIMIT", 1]]