app/models/demo_content.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "subtitle", "author", "published", "slug", "everyone_access", "theme") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2025-09-22 16:47:09.436057"], ["id", 1]]
---
      def create_book(user)
        Book.create(title: "The Writebook Manual", author: "37signals", everyone_access: true).tap do |book|
          with_attachment("writebook-manual.jpg") { |attachment| book.cover.attach(attachment) }
          book.update_access(readers: [], editors: [ user.id ])

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def load_markdown_pages(book)
        pages = {}

        Dir.glob(Rails.root.join("app/assets/markdown/demo/*.md")).each do |fname|
          front_matter = FrontMatterParser::Parser.parse_file(fname)

          if front_matter["class"] == "Section"
            load_section(book, front_matter)
          else
            page = load_markdown_page(book, front_matter)
            attach_images(page)
            pages[page.leaf.slug] = page
          end
        end

        book.leaves.pages.each { |leaf| localize_ref_links(leaf.page, pages) }

UPDATE "pages" SET "updated_at" = ? WHERE "pages"."id" = ?  [["updated_at", "2025-09-22 16:47:09.882860"], ["id", 2]]
---
      def attach_images(page)
        re = %r{
          \/u\/           # leading portion of path
          (\S+-\w+\.\w+)  # filename including slug and extension
        }x

        body = page.body.content.gsub(re) do |match|
          with_attachment($1) { |attachment| page.body.uploads.attach(attachment) }

          attachment = page.body.uploads.attachments.last
          attachment.analyze

          "/u/" + attachment.slug
        end

        page.update!(body: body)

UPDATE "pages" SET "updated_at" = ? WHERE "pages"."id" = ?  [["updated_at", "2025-09-22 16:47:12.447940"], ["id", 6]]
---
      def localize_ref_links(page, pages)
        re = %r{
          (\[.+\])              # link title
          \(                    # opening paren
          \/\d+\/[\w-]+\/\d+\/  # leading portion of path
          ([\w-]+)              # leaf slug
        }x

        body = page.body.content.gsub(re) do |match|
          link_title, leaf_slug, anchor = $1, $2, $3
          linked_page = pages[leaf_slug]
          raise "Invalid reference link: #{page_title}" unless linked_page.present?

          url = Rails.application.routes.url_helpers.leafable_slug_path(linked_page.leaf, anchor: anchor, only_path: true)

          "#{link_title}(#{url}"
        end

        page.update!(body: body)