app/models/edit.rb

  def previous
    leaf.edits.before(self).last
---
SELECT "edits".* FROM "edits" WHERE "edits"."leaf_id" = ? AND (created_at < ?) ORDER BY "edits"."id" DESC LIMIT ?  [["leaf_id", 1], [nil, "2025-09-22 17:10:34.678134"], ["LIMIT", 1]]

  def next
    leaf.edits.after(self).first
---
SELECT "edits".* FROM "edits" WHERE "edits"."leaf_id" = ? AND (created_at > ?) ORDER BY "edits"."id" ASC LIMIT ?  [["leaf_id", 1], [nil, "2025-09-22 17:10:34.678134"], ["LIMIT", 1]]