app/models/first_run.rb

INSERT INTO "accounts" ("name", "join_code", "created_at", "updated_at", "custom_styles") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Writebook"], ["join_code", "UpNG-CDNE-ipBi"], ["created_at", "2025-09-22 16:47:09.111710"], ["updated_at", "2025-09-22 16:47:09.111710"], ["custom_styles", nil]]
INSERT INTO "users" ("name", "email_address", "password_digest", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def self.create!(user_params)
    account = Account.create!(name: ACCOUNT_NAME)

    User.create!(user_params.merge(role: :administrator)).tap do |user|