app/models/user.rb

SELECT "books"."id" FROM "books" WHERE "books"."everyone_access" = ?  [["everyone_access", 1]]
---
    def grant_access_to_everyone_books
      all_accesses = Book.with_everyone_access.ids.collect { |id| { book_id: id, level: :reader } }