app/controllers/concerns/page_leaf_scoped.rb

    def set_leaf
      @leaf = Current.user.leaves.find(params[:page_id])
---
SELECT "leaves".* FROM "leaves" INNER JOIN "books" ON "leaves"."book_id" = "books"."id" INNER JOIN "accesses" ON "books"."id" = "accesses"."book_id" WHERE "accesses"."user_id" = ? AND "leaves"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]