app/controllers/pages/edits_controller.rb

SELECT "edits".* FROM "edits" WHERE "edits"."leaf_id" = ? ORDER BY "edits"."id" DESC LIMIT ?  [["leaf_id", 1], ["LIMIT", 1]]
SELECT "edits".* FROM "edits" WHERE "edits"."leaf_id" = ? AND (created_at > ?) ORDER BY "edits"."id" ASC LIMIT ?  [["leaf_id", 1], [nil, "2025-09-22 17:10:34.678134"], ["LIMIT", 1]]
---
    def set_edit
      if params[:id] == "latest"
        @edit = @leaf.edits.last
      else
        @edit = @leaf.edits.find(params[:id])